Revit 2027 API
RebarConstraint.IsToOtherRebar Method
 Checks if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsToOtherRebar()
Public Function IsToOtherRebar As Boolean
public:
bool IsToOtherRebar()
member IsToOtherRebar : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar', false otherwise.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace